zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3c1xx/SI32_SIM3C1XX_PMU_A_Registers.h
//------------------------------------------------------------------------------
// Copyright 2012 (c) Silicon Laboratories Inc.
//
// SPDX-License-Identifier: Zlib
//
// This siHAL software is provided 'as-is', without any express or implied
// warranty. In no event will the authors be held liable for any damages
// arising from the use of this software.
//
// Permission is granted to anyone to use this software for any purpose,
// including commercial applications, and to alter it and redistribute it
// freely, subject to the following restrictions:
//
// 1. The origin of this software must not be misrepresented; you must not
//    claim that you wrote the original software. If you use this software
//    in a product, an acknowledgment in the product documentation would be
//    appreciated but is not required.
// 2. Altered source versions must be plainly marked as such, and must not be
//    misrepresented as being the original software.
// 3. This notice may not be removed or altered from any source distribution.
//------------------------------------------------------------------------------
//
// This file applies to the SIM3C1XX_PMU_A module
//
// Script: 0.57
// Version: 1

#ifndef __SI32_PMU_A_REGISTERS_H__
#define __SI32_PMU_A_REGISTERS_H__

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

struct SI32_PMU_A_CONTROL_Struct
{
   union
   {
      struct
      {
         // Wakeup Source Clear
         volatile uint32_t WAKECLR: 1;
         // Peripheral Low Power Enable
         volatile uint32_t PERILPEN: 1;
         // Pin Low Power Enable
         volatile uint32_t PINLPEN: 1;
         // Pin Wake Match Enable
         volatile uint32_t PWAKEEN: 1;
         // PMU Asleep Pin Enable
         volatile uint32_t PMUASLPEN: 1;
                  uint32_t reserved0: 27;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PMU_A_CONTROL_WAKECLR_MASK  0x00000001
#define SI32_PMU_A_CONTROL_WAKECLR_SHIFT  0
// Clear all wakeup sources.
#define SI32_PMU_A_CONTROL_WAKECLR_CLEAR_VALUE  0
#define SI32_PMU_A_CONTROL_WAKECLR_CLEAR_U32 \
   (SI32_PMU_A_CONTROL_WAKECLR_CLEAR_VALUE << SI32_PMU_A_CONTROL_WAKECLR_SHIFT)

#define SI32_PMU_A_CONTROL_PERILPEN_MASK  0x00000002
#define SI32_PMU_A_CONTROL_PERILPEN_SHIFT  1
// Disable the peripheral low power state.
#define SI32_PMU_A_CONTROL_PERILPEN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_PERILPEN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_PERILPEN_DISABLED_VALUE << SI32_PMU_A_CONTROL_PERILPEN_SHIFT)
// Enable the peripheral low power state. The peripherals will not be accessible in
// this state.
#define SI32_PMU_A_CONTROL_PERILPEN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_PERILPEN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_PERILPEN_ENABLED_VALUE << SI32_PMU_A_CONTROL_PERILPEN_SHIFT)

#define SI32_PMU_A_CONTROL_PINLPEN_MASK  0x00000004
#define SI32_PMU_A_CONTROL_PINLPEN_SHIFT  2
// Disable the pin low power state.
#define SI32_PMU_A_CONTROL_PINLPEN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_PINLPEN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_PINLPEN_DISABLED_VALUE << SI32_PMU_A_CONTROL_PINLPEN_SHIFT)
// Enable the pin low power state. The pins will not be accessible in this state.
#define SI32_PMU_A_CONTROL_PINLPEN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_PINLPEN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_PINLPEN_ENABLED_VALUE << SI32_PMU_A_CONTROL_PINLPEN_SHIFT)

#define SI32_PMU_A_CONTROL_PWAKEEN_MASK  0x00000008
#define SI32_PMU_A_CONTROL_PWAKEEN_SHIFT  3
// Disable Pin Wake.
#define SI32_PMU_A_CONTROL_PWAKEEN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_PWAKEEN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_PWAKEEN_DISABLED_VALUE << SI32_PMU_A_CONTROL_PWAKEEN_SHIFT)
// Enable Pin Wake.
#define SI32_PMU_A_CONTROL_PWAKEEN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_PWAKEEN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_PWAKEEN_ENABLED_VALUE << SI32_PMU_A_CONTROL_PWAKEEN_SHIFT)

#define SI32_PMU_A_CONTROL_PMUASLPEN_MASK  0x00000010
#define SI32_PMU_A_CONTROL_PMUASLPEN_SHIFT  4
// Disable the PMU Asleep pin.
#define SI32_PMU_A_CONTROL_PMUASLPEN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_PMUASLPEN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_PMUASLPEN_DISABLED_VALUE << SI32_PMU_A_CONTROL_PMUASLPEN_SHIFT)
// Enable the PMU Asleep pin.
#define SI32_PMU_A_CONTROL_PMUASLPEN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_PMUASLPEN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_PMUASLPEN_ENABLED_VALUE << SI32_PMU_A_CONTROL_PMUASLPEN_SHIFT)



struct SI32_PMU_A_CONFIG_Struct
{
   union
   {
      struct
      {
                  uint32_t reserved0: 8;
         // RTC0 Fail RTC0/LPTIMER0 Reset Enable
         volatile uint32_t RTC0FREN: 1;
         // RTC0 Alarm RTC0/LPTIMER0 Reset Enable
         volatile uint32_t RTC0AREN: 1;
                  uint32_t reserved1: 3;
         // Comparator 0 RTC0/LPTIMER0 Reset Enable
         volatile uint32_t CMP0REN: 1;
         // Pin Wake RTC0/LPTIMER0 Reset Enable
         volatile uint32_t PWAKEREN: 1;
         // Low Power Timer RTC0/LPTIMER0 Reset Enable
         volatile uint32_t LPT0REN: 1;
                  uint32_t reserved2: 16;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PMU_A_CONFIG_RTC0FREN_MASK  0x00000100
#define SI32_PMU_A_CONFIG_RTC0FREN_SHIFT  8
// An RTC0 fail event does not cause the RTC0 and LPTIMER0 modules to reset.
#define SI32_PMU_A_CONFIG_RTC0FREN_DISABLED_VALUE  0
#define SI32_PMU_A_CONFIG_RTC0FREN_DISABLED_U32 \
   (SI32_PMU_A_CONFIG_RTC0FREN_DISABLED_VALUE << SI32_PMU_A_CONFIG_RTC0FREN_SHIFT)
// An RTC0 fail event causes the RTC0 and LPTIMER0 modules to reset.
#define SI32_PMU_A_CONFIG_RTC0FREN_ENABLED_VALUE  1
#define SI32_PMU_A_CONFIG_RTC0FREN_ENABLED_U32 \
   (SI32_PMU_A_CONFIG_RTC0FREN_ENABLED_VALUE << SI32_PMU_A_CONFIG_RTC0FREN_SHIFT)

#define SI32_PMU_A_CONFIG_RTC0AREN_MASK  0x00000200
#define SI32_PMU_A_CONFIG_RTC0AREN_SHIFT  9
// An RTC0 alarm event does not cause the RTC0 and LPTIMER0 modules to reset.
#define SI32_PMU_A_CONFIG_RTC0AREN_DISABLED_VALUE  0
#define SI32_PMU_A_CONFIG_RTC0AREN_DISABLED_U32 \
   (SI32_PMU_A_CONFIG_RTC0AREN_DISABLED_VALUE << SI32_PMU_A_CONFIG_RTC0AREN_SHIFT)
// An RTC0 alarm event causes the RTC0 and LPTIMER0 modules to reset.
#define SI32_PMU_A_CONFIG_RTC0AREN_ENABLED_VALUE  1
#define SI32_PMU_A_CONFIG_RTC0AREN_ENABLED_U32 \
   (SI32_PMU_A_CONFIG_RTC0AREN_ENABLED_VALUE << SI32_PMU_A_CONFIG_RTC0AREN_SHIFT)

#define SI32_PMU_A_CONFIG_CMP0REN_MASK  0x00002000
#define SI32_PMU_A_CONFIG_CMP0REN_SHIFT  13
// A Comparator 0 event does not cause the RTC0 and LPTIMER0 modules to reset.
#define SI32_PMU_A_CONFIG_CMP0REN_DISABLED_VALUE  0
#define SI32_PMU_A_CONFIG_CMP0REN_DISABLED_U32 \
   (SI32_PMU_A_CONFIG_CMP0REN_DISABLED_VALUE << SI32_PMU_A_CONFIG_CMP0REN_SHIFT)
// A Comparator 0 event causes the RTC0 and LPTIMER0 modules to reset.
#define SI32_PMU_A_CONFIG_CMP0REN_ENABLED_VALUE  1
#define SI32_PMU_A_CONFIG_CMP0REN_ENABLED_U32 \
   (SI32_PMU_A_CONFIG_CMP0REN_ENABLED_VALUE << SI32_PMU_A_CONFIG_CMP0REN_SHIFT)

#define SI32_PMU_A_CONFIG_PWAKEREN_MASK  0x00004000
#define SI32_PMU_A_CONFIG_PWAKEREN_SHIFT  14
// A Pin Wake event does not cause the RTC0 and LPTIMER0 modules to reset.
#define SI32_PMU_A_CONFIG_PWAKEREN_DISABLED_VALUE  0
#define SI32_PMU_A_CONFIG_PWAKEREN_DISABLED_U32 \
   (SI32_PMU_A_CONFIG_PWAKEREN_DISABLED_VALUE << SI32_PMU_A_CONFIG_PWAKEREN_SHIFT)
// A Pin Wake event causes the RTC0 and LPTIMER0 modules to reset.
#define SI32_PMU_A_CONFIG_PWAKEREN_ENABLED_VALUE  1
#define SI32_PMU_A_CONFIG_PWAKEREN_ENABLED_U32 \
   (SI32_PMU_A_CONFIG_PWAKEREN_ENABLED_VALUE << SI32_PMU_A_CONFIG_PWAKEREN_SHIFT)

#define SI32_PMU_A_CONFIG_LPT0REN_MASK  0x00008000
#define SI32_PMU_A_CONFIG_LPT0REN_SHIFT  15
// An LPTIMER0 event does not cause the RTC0 and LPTIMER0 modules to reset.
#define SI32_PMU_A_CONFIG_LPT0REN_DISABLED_VALUE  0
#define SI32_PMU_A_CONFIG_LPT0REN_DISABLED_U32 \
   (SI32_PMU_A_CONFIG_LPT0REN_DISABLED_VALUE << SI32_PMU_A_CONFIG_LPT0REN_SHIFT)
// An LPTIMER0 event causes the RTC0 and LPTIMER0 modules to reset.
#define SI32_PMU_A_CONFIG_LPT0REN_ENABLED_VALUE  1
#define SI32_PMU_A_CONFIG_LPT0REN_ENABLED_U32 \
   (SI32_PMU_A_CONFIG_LPT0REN_ENABLED_VALUE << SI32_PMU_A_CONFIG_LPT0REN_SHIFT)



